In [1]:
! pip install pandas

Requirement already satisfied: pandas in /opt/homebrew/anaconda3/envs/ds201/lib/python3.10/site-packages (1.5.3)
Requirement already satisfied: pytz>=2020.1 in /opt/homebrew/anaconda3/envs/ds201/lib/python3.10/site-packages (from pandas) (2022.7.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/homebrew/anaconda3/envs/ds201/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in /opt/homebrew/anaconda3/envs/ds201/lib/python3.10/site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in /opt/homebrew/anaconda3/envs/ds201/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd

# Pandas Data Structures

## Series

In [2]:
import numpy as np
numpy_array = np.random.rand(12)
numpy_array

array([0.68066816, 0.05183307, 0.06215594, 0.73876852, 0.24798702,
       0.32201157, 0.04812339, 0.87709026, 0.44397844, 0.0824073 ,
       0.1425767 , 0.82899498])

In [3]:
pandas_series = pd.Series(numpy_array)
pandas_series

0     0.680668
1     0.051833
2     0.062156
3     0.738769
4     0.247987
5     0.322012
6     0.048123
7     0.877090
8     0.443978
9     0.082407
10    0.142577
11    0.828995
dtype: float64

In [5]:
pandas_series = pd.Series(numpy_array, index=['b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'a'])
pandas_series

b    0.680668
c    0.051833
d    0.062156
e    0.738769
f    0.247987
g    0.322012
h    0.048123
i    0.877090
j    0.443978
k    0.082407
l    0.142577
a    0.828995
dtype: float64

In [6]:
pandas_series.index

Index(['b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'a'], dtype='object')

In [7]:
pandas_series.values

array([0.68066816, 0.05183307, 0.06215594, 0.73876852, 0.24798702,
       0.32201157, 0.04812339, 0.87709026, 0.44397844, 0.0824073 ,
       0.1425767 , 0.82899498])

In [8]:
pandas_object_series = pandas_series.index.to_series()
pandas_object_series

b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
j    j
k    k
l    l
a    a
dtype: object

In [9]:
pandas_object_series = pandas_object_series.reset_index(drop=True)
pandas_object_series

0     b
1     c
2     d
3     e
4     f
5     g
6     h
7     i
8     j
9     k
10    l
11    a
dtype: object

In [11]:
pandas_series.name = 'deneme_serisi'

## DataFrame
df

In [12]:
df = pandas_series.reset_index(drop=False)
df

   index  deneme_serisi
0      b       0.680668
1      c       0.051833
2      d       0.062156
3      e       0.738769
4      f       0.247987
5      g       0.322012
6      h       0.048123
7      i       0.877090
8      j       0.443978
9      k       0.082407
10     l       0.142577
11     a       0.828995

In [13]:
print(df.columns)

Index(['index', 'deneme_serisi'], dtype='object')

In [14]:
df.columns = ['index', 'value']
df

   index     value
0      b  0.680668
1      c  0.051833
2      d  0.062156
3      e  0.738769
4      f  0.247987
5      g  0.322012
6      h  0.048123
7      i  0.877090
8      j  0.443978
9      k  0.082407
10     l  0.142577
11     a  0.828995

In [22]:
# df[['value', 'index']]
# df['other_series'] = pandas_object_series
df['other_series'] = 'test'
df[['index', 'other_series', 'value']]

   index other_series     value
0      b         test  0.680668
1      c         test  0.051833
2      d         test  0.062156
3      e         test  0.738769
4      f         test  0.247987
5      g         test  0.322012
6      h         test  0.048123
7      i         test  0.877090
8      j         test  0.443978
9      k         test  0.082407
10     l         test  0.142577
11     a         test  0.828995

In [24]:
pandas_object_series.shape

(12,)

In [23]:
df.shape

(12, 3)

# Basic Functions

In [28]:
# df = df.drop(5, axis=0)
# df.drop(5, axis=0, inplace=True)
df.drop(5, axis=0)

   index     value other_series
0      b  0.680668         test
1      c  0.051833         test
2      d  0.062156         test
3      e  0.738769         test
4      f  0.247987         test
6      h  0.048123         test
7      i  0.877090         test
8      j  0.443978         test
9      k  0.082407         test
10     l  0.142577         test
11     a  0.828995         test

In [33]:
df.drop('index', axis=1)

       value other_series
0   0.680668         test
1   0.051833         test
2   0.062156         test
3   0.738769         test
4   0.247987         test
5   0.322012         test
6   0.048123         test
7   0.877090         test
8   0.443978         test
9   0.082407         test
10  0.142577         test
11  0.828995         test

In [34]:
df.rename(columns={'index': 'letters'}, inplace=False)

   letters     value other_series
0        b  0.680668         test
1        c  0.051833         test
2        d  0.062156         test
3        e  0.738769         test
4        f  0.247987         test
5        g  0.322012         test
6        h  0.048123         test
7        i  0.877090         test
8        j  0.443978         test
9        k  0.082407         test
10       l  0.142577         test
11       a  0.828995         test

In [36]:
df.rename(columns={'index': 'letters'}, inplace=True)
df

   letters     value other_series
0        b  0.680668         test
1        c  0.051833         test
2        d  0.062156         test
3        e  0.738769         test
4        f  0.247987         test
5        g  0.322012         test
6        h  0.048123         test
7        i  0.877090         test
8        j  0.443978         test
9        k  0.082407         test
10       l  0.142577         test
11       a  0.828995         test

## Accessing Elements

In [38]:
df['value']

0     0.680668
1     0.051833
2     0.062156
3     0.738769
4     0.247987
5     0.322012
6     0.048123
7     0.877090
8     0.443978
9     0.082407
10    0.142577
11    0.828995
Name: value, dtype: float64

In [39]:
df.loc[:, 'value']

0     0.680668
1     0.051833
2     0.062156
3     0.738769
4     0.247987
5     0.322012
6     0.048123
7     0.877090
8     0.443978
9     0.082407
10    0.142577
11    0.828995
Name: value, dtype: float64

In [40]:
df.loc[4, 'value']

0.2479870234069551

In [44]:
df.loc[4, 'value'] = pd.NA
df.loc[6, 'other_series'] = pd.NA
df

   letters     value other_series
0        b  0.680668         test
1        c  0.051833         test
2        d  0.062156         test
3        e  0.738769         test
4        f       NaN         test
5        g  0.322012         test
6        h  0.048123         <NA>
7        i  0.877090         test
8        j  0.443978         test
9        k  0.082407         test
10       l  0.142577         test
11       a  0.828995         test

In [45]:
df.loc[3:5, 'letters']

3    e
4    f
5    g
Name: letters, dtype: object

In [46]:
df.loc[3:5, ['letters', 'value']]

  letters     value
3       e  0.738769
4       f       NaN
5       g  0.322012

In [47]:
# df.loc[3:5, 0]
df.iloc[3:5, 0]

3    e
4    f
Name: letters, dtype: object

In [48]:
df.dropna(axis=0)

   letters     value other_series
0        b  0.680668         test
1        c  0.051833         test
2        d  0.062156         test
3        e  0.738769         test
5        g  0.322012         test
7        i  0.877090         test
8        j  0.443978         test
9        k  0.082407         test
10       l  0.142577         test
11       a  0.828995         test

In [50]:
df.dropna(subset=['value'], axis=0)

   letters     value other_series
0        b  0.680668         test
1        c  0.051833         test
2        d  0.062156         test
3        e  0.738769         test
5        g  0.322012         test
6        h  0.048123         <NA>
7        i  0.877090         test
8        j  0.443978         test
9        k  0.082407         test
10       l  0.142577         test
11       a  0.828995         test

In [57]:
df.dropna(subset=range(1,12,2), axis=1)

   letters     value other_series
0        b  0.680668         test
1        c  0.051833         test
2        d  0.062156         test
3        e  0.738769         test
4        f       NaN         test
5        g  0.322012         test
6        h  0.048123         <NA>
7        i  0.877090         test
8        j  0.443978         test
9        k  0.082407         test
10       l  0.142577         test
11       a  0.828995         test

In [59]:
?df.fillna

Signature:
df.fillna(
    value: 'Hashable | Mapping | Series | DataFrame' = None,
    *,
    method: 'FillnaOptions | None' = None,
    axis: 'Axis | None' = None,
    inplace: 'bool' = False,
    limit: 'int | None' = None,
    downcast: 'dict | None' = None,
) -> 'DataFrame | None'
Docstring:
Fill NA/NaN values using the specified method.

Parameters
----------
value : scalar, dict, Series, or DataFrame
    Value to use to fill holes (e.g. 0), alternately a
    dict/Series/DataFrame of values specifying which value to use for
    each index (for a Series) or column (for a DataFrame).  Values not
    in the dict/Series/DataFrame will not be filled. This value cannot
    be a list.
method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
    Method to use for filling holes in reindexed Series
    pad / ffill: propagate last valid observation forward to next valid
    backfill / bfill: use next valid observation to fill gap.
axis : {0 or 'index', 1 or 'columns'}
    Axis along which to fill missing values. For `Series`
    this parameter is unused and defaults to 0.
inplace : bool, default False
    If True, fill in-place. Note: this will modify any
    other views on this object (e.g., a no-copy slice for a column in a
    DataFrame).
limit : int, default None
    If method is specified, this is the maximum number of consecutive
    NaN values to forward/backward fill. In other words, if there is
    a gap with more than this number of consecutive NaNs, it will only
    be partially filled. If method is not specified, this is the
    maximum number of entries along the entire axis where NaNs will be
    filled. Must be greater than 0 if not None.
downcast : dict, default is None
    A dict of item->dtype of what to downcast if possible,
    or the string 'infer' which will try to downcast to an appropriate
    equal type (e.g. float64 to int64 if possible).

Returns
-------
DataFrame or None
    Object with missing values filled or None if ``inplace=True``.

See Also
--------
interpolate : Fill NaN values using interpolation.
reindex : Conform object to new index.
asfreq : Convert TimeSeries to specified frequency.

Examples
--------
>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
...                    [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, np.nan],
...                    [np.nan, 3, np.nan, 4]],
...                   columns=list("ABCD"))
>>> df
     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

Replace all NaN elements with 0s.

>>> df.fillna(0)
     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

We can also propagate non-null values forward or backward.

>>> df.fillna(method="ffill")
     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
2, and 3 respectively.

>>> values = {"A": 0, "B": 1, "C": 2, "D": 3}
>>> df.fillna(value=values)
     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

Only replace the first NaN element.

>>> df.fillna(value=values, limit=1)
     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  NaN  1.0
2  NaN  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

When filling using a DataFrame, replacement happens along
the same column names and same indices

>>> df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))
>>> df.fillna(df2)
     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  0.0  3.0  0.0  4.0

Note that column D is not affected since it is not present in df2.
File:      /opt/homebrew/anaconda3/envs/ds201/lib/python3.10/site-packages/pandas/core/frame.py
Type:      method

In [60]:
df['value'].fillna(df['value'].mean())

0     0.680668
1     0.051833
2     0.062156
3     0.738769
4     0.388964
5     0.322012
6     0.048123
7     0.877090
8     0.443978
9     0.082407
10    0.142577
11    0.828995
Name: value, dtype: float64

In [63]:
# df['value']
df.value

0     0.680668
1     0.051833
2     0.062156
3     0.738769
4          NaN
5     0.322012
6     0.048123
7     0.877090
8     0.443978
9     0.082407
10    0.142577
11    0.828995
Name: value, dtype: float64

In [64]:
df['value']

0     0.680668
1     0.051833
2     0.062156
3     0.738769
4          NaN
5     0.322012
6     0.048123
7     0.877090
8     0.443978
9     0.082407
10    0.142577
11    0.828995
Name: value, dtype: float64

In [65]:
df[['letters', 'value']]

   letters     value
0        b  0.680668
1        c  0.051833
2        d  0.062156
3        e  0.738769
4        f       NaN
5        g  0.322012
6        h  0.048123
7        i  0.877090
8        j  0.443978
9        k  0.082407
10       l  0.142577
11       a  0.828995

### Access by condition

In [68]:
df['value'] == pd.NA

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: value, dtype: bool

In [69]:
pd.isna(df.value)

0     False
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: value, dtype: bool

In [71]:
df.letters == 'f'

0     False
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: letters, dtype: bool

In [72]:
df.loc[df['letters'] == 'f', 'value']

4   NaN
Name: value, dtype: float64

In [73]:
df.loc[pd.isna(df['value']), 'value']

4   NaN
Name: value, dtype: float64

In [63]:
df.loc[df.letters == 'f', 'value'] = -4
df

   letters     value
0        a  0.805192
1        b  0.023471
2        c  0.955694
3        d  0.854670
4        e       NaN
5        f -4.000000
6        g  0.914700
7        h  0.730077
8        i  0.398460
9        j  0.352610
10       k  0.599144
11       l  0.663068